
import re
group = "Р0515"
s1 = "Петров-Петя П.П. Р0515 Анищенко А.А. P33113 Примеров Е.В. P000 Иванов И.И. P000"
s2 = "Иванов П.С. Р35735 Примеров Е.В. P000 Путин В.В. Р0515 Иванов И.И. P000"
s3 = 'Ануфриев А.А. Р3119 Анищенко А.А. Р0515 Вукиьщ В.А. Р6466 Примеров Е.В. P000'
s4 = 'Торопов Т.Т. Р3119 Петров-Петя П.П. Р0515'
s5 = 'Анищенко А.А. P33113 Примеров Е.В. P000 Путин В.В. Р0515 Ануфриев А.А. Р3119 Анищенко А.А.'


def chek (s, group):
    k = re.split(r'\s', s)
    for i in range(0, len(k)-3, 3):
        l = re.findall(r'[А-Я]', k[i]) + re.findall(r'[А-Я]', k[i+1])
        if len(set(l))==1 and k[i+2] == group:
            k.pop(i)
            k.pop(i)
            k.pop(i)
    return k
print(s1)
print(*chek(s1, group))
